<div class="recruitItem">
    <p style="text-indent:24px;">
        欢迎您申请成为蝌蚪网的签约播客。请您在申请前， 详细阅读本协议的所有内容（未成年人应在监护人陪同下阅读），特别是免除或限制责任的条款、争议解决和法律适用条款。如您不同意本协议或蝌蚪网随时对其的修改，请勿继续申请签约播客流程。当您申请签约播客过程中勾选“我同意”按钮后， 即表示您已完全理解并接受本协议的所有约定，此后您不得以未阅读本协议内容或类似言辞做任何形式的抗辩。</p>
    <p class="tit">一、总则</p>
    <p>1．本协议由您与蝌蚪网的运营主体共同缔结，具有合同效力。您在蝌蚪网的行为，包括但不限于您申请成为播客、您以播客身份进行歌曲演唱、脱口秀等任何形式的在线表演活动、您从蝌蚪网用户处获得礼物、参与蝌蚪网举办的活动、在蝌蚪网上传、发布信息等，均受本协议约束。</p>
    <p>2．蝌蚪网包括但不限于网址为： www.蝌蚪.com／www.laifeng.com的网站及移动客户端及其升级版本，以及将来可能出现以信息网络为传输渠道的其他终端平台。</p>
    <p>3．本协议内容包括协议正文及所有蝌蚪网已经发布或将来可能发布的各类规范、公告或通知。如无明确的相反说明，则该等规范、公告或通知与本协议正文合称“本协议”，为本协议不可分割的组成部分，与协议正文具有同等法律效力。</p>
    <p>4．蝌蚪网有权根据需要，不时修改本协议，并以网站公示的方式发布，无需另行单独通知您。变更后的协议一经公布，立即或在公示时明确的特定时间自动生效。若您在前述变更后继续使用蝌蚪网服务的，即表示您已经阅读、理解并接受经修订的协议内容。</p>
    <p class="tit">二、蝌蚪网及其服务</p>
    <p>1．通过蝌蚪网和该平台接入的其他服务，播客可以创建和装饰网上直播间、在线进行才艺表演、获得用户赠送的虚拟礼品；用户可以与播客进行在线互动、购买星币后对播客的表演予以奖赏。</p>
    <p>2．蝌蚪网将竭力提升播客知名度和用户活跃度。播客和用户可参加蝌蚪网组织的活动以及使用其它信息服务及技术服务，具体以蝌蚪网不时公布的活动或服务内容为准。同时播客也有义务积极提高活跃度，如播客帐号在连续（30）日内未实际使用，则蝌蚪有权取消其播客资格并停止为该用户提供相关的网络服务及任何结算，相关损失由播客承担。</p>
    <p>3．蝌蚪网为播客提供视频直播有关的网站技术支持服务，除此之外因视频直播所需的环境、设备（包括但不限于网络、电脑、麦克风、视频装置等软件、硬件）等条件以及费用均由播客自行负担。</p>
    <p>4．为促进蝌蚪网的良性发展，蝌蚪网有权（但无义务）指定或委托第三方自然人、公司等法律实体对播客的表演行为进行管理、指导，该等第三方可能命名为“机构”或其他名称，以使播客和用户之间能够良好地互动。播客应尊重并服从蝌蚪网此种安排并接受该等第三方的管理及指导。</p>
    <p>5．为规范蝌蚪网的良好秩序，蝌蚪有权（但无义务）调配播客的才艺表演安排，包括但不限于表演的时段、时长、方式等，播客应尊重并服从蝌蚪网的管理。</p>
    <p>6．如播客的才艺表演出现任何有损蝌蚪网利益、品牌形象之情况时，蝌蚪网有权采取相应措施进行干预，包括但不限于立即中断在线表演、限制/冻结播客的权限、追究播客的违约责任等。</p>
    <p>7．为使平台服务更加规范化、系统化，蝌蚪网将按照法律法规的要求，不时制定、调整与播客才艺表演相关的规范、制度，并通过系统公告、系统通知、当面告知等的方式通知播客，敬请播客注意查询并应予遵守。</p>
    <p class="tit">三、播客资格和行为规范</p>
    <p>1．为获取播客资格，您需先注册登录。您在此明确授权，在您账户注册成功时，您的注册信息已授权蝌蚪网披露和使用，以便更好地为您提供服务。</p>
    <p>2．蝌蚪网将对您在申请成为播客的过程中提交的资料予以审核，且有权独立决定是否给予您签约播客资格。</p>
    <p>3．您应当具有缔结并完全履行本协议的资格和能力。若您不具备完全民事行为能力，则您及您的监护人应承担因此而导致的一切后果，且蝌蚪网有权注销或永久冻结您的账户，并向您及您的监护人索偿相应损失。</p>
    <p>4．因您提供的个人信息（身份证号、银行账号、联系方式、居住地址等）、资料是蝌蚪网判断您身份的重要依据，故您需保证提供给蝌蚪网的所有信息的真实性、完整性、合法性和有效性。如有任何变动，您必须及时通知蝌蚪网。如因您提交的信息资料违反该约定的，您应自行承担由此发生的所有责任和损失，蝌蚪网有权中止/终止您使用蝌蚪网的任何一项或全部服务。</p>
    <p>5．播客不可撤销地授权蝌蚪在本协议期间及期满或终止后，可无偿自由使用播客之署名（包括但不限于姓名、艺名、网名等）及肖像；如播客希望排他性独家在蝌蚪网开展在线才艺表演的，则可联系蝌蚪在线客服，或蝌蚪网也将主动联系相关播客，双方将另行签署书面协议明确独家合作事项。</p>
    <p>6．播客在进行才艺表演时，应当符合法律法规及相关政策的规定，遵守蝌蚪网不时发布的《蝌蚪播客行为规范》，确保表演过程中无任何不符合公序良俗、非法或侵害第三方合法权益的内容。播客应保证对上传或者发表于蝌蚪网的所有信息，包括但不限于文字、图片、音乐、电影、表演和录音录像制品等均享有完整的知识产权或者已经得到相关权利人的合法授权。如播客违反约定造成蝌蚪网遭受行政处罚或被第三人索赔等情况，播客应承担全部法律责任，并赔偿蝌蚪网损失。</p>
    <p>7．播客需遵守诚实信用原则，不采取不正当竞争行为，不扰乱蝌蚪网的正常秩序，未经蝌蚪网同意不发布商业广告，不从事与在线才艺表演无关的活动，不得利用蝌蚪网提供的网络技术服务进行任何不利于蝌蚪网的行为。</p>
    <p>8．播客如发现任何用户对其才艺表演存在误导性理解，或发表不正当评论时，播客应立即采取有效措施修正或停止其才艺表演行为，并及时通过有效方式向蝌蚪网进行通报，但蝌蚪网不对用户行为承担任何责任。</p>
    <p class="tit">四、播客收益相关</p>
    <p>1．播客在蝌蚪网提供符合本协议规定的在线才艺表演，可以获得用户给予的奖赏，该奖赏由蝌蚪网支付给播客。</p>
    <p>2．播客同意在使用蝌蚪网提供的服务时，向蝌蚪网支付一定金额的平台服务费，该服务费由蝌蚪网按比例从播客获得的用户奖赏中直接扣除。蝌蚪网会将具体扣除比例以不特定形式向播客明示，该比例以蝌蚪网通知为准。</p>
    <p>3．有关收益的相关政策及规则详见蝌蚪网的系统公告及蝌蚪网以其他方式发出的通知、说明。播客同意所有结算数据以蝌蚪网统计数据为准，蝌蚪网保证数据的真实性。</p>
    <p>4．播客开展本协议所涉之合作事项而获得的实际应得奖赏为税后收入，蝌蚪网将代缴法定税费。</p>
    <p class="tit">五、知识产权</p>
    <p>1．蝌蚪网及其所载之内容、提供之服务所包含的所有知识产权归蝌蚪网所有。除非获得蝌蚪网的明确授权，否则任何时候播客不得擅自复制或使用蝌蚪网所载之内容、蝌蚪网相关的应用、软件等，亦不得擅自使用蝌蚪网及其关联公司的任何标识，包括但不限于商标、域名、LOGO等。</p>
    <p>2．播客对其在线才艺表演享有法定权益，蝌蚪网有权对其在线表演活动进行录音录像。</p>
    <p>3．播客同意永久、不可撤销地授权蝌蚪网复制、发行或以其他方式向公众传播载有播客表演的录音/录像制品及播客上传的文字、图片、视频等（统称作品），例如以有线或者无线方式通过信息网络、广播电视网络、电信网等向公众传播，以及修改、改编、出版、翻译、据以创作衍生作品、表演和展示此等作品 （整体或部分），和/或将此等作品编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。对此，蝌蚪网无需额外向播客支付任何费用。对于擅自盗播或以其他方式使用上述作品的行为，蝌蚪网有权单独展开维权活动。在此情况下，播客应对蝌蚪网的维权行为给予积极配合和支持。</p>
    <p>4．为更好的维护蝌蚪网的运营，进而给播客及用户提供良好的服务，并根据法律法规的要求，蝌蚪网有权记录、审查、保存、使用播客通过蝌蚪网进行在线才艺表演过程中产生的并储存于蝌蚪网或其关联公司服务器中的数据信息（包括但不限于账户数据信息、用户登录数据等），例如传递给向播客提供其他服务的蝌蚪网的关联公司或其他组织，或从提供其他服务的蝌蚪网关联公司或其他组织获取播客的相关个人信息。该使用的权利不因本协议的解除或终止而失去效力。</p>

    <p class="tit">六、非劳动关系</p>
    <p>播客与蝌蚪网或其关联公司之间不存在任何的劳动关系，蝌蚪网不承担播客的任何费用，包括但不限于社会保险、福利和医疗保险费用，播客也不享用蝌蚪网为其职员提供的各项福利政策。</p>
    <p class="tit">七、播客隐私的保护</p>
    <p>1．尊重个人隐私是蝌蚪网的重要政策。在未经授权的情况下，蝌蚪网不会公开或向第三方透露播客的个人真实资料。但如根据法律规定或政府部门的命令或以下情况下，蝌蚪网可不经授权而向相关部门或第三方公开或透露播客的信息：</p>
    <p>（1） 在紧急情况下为维护第三人或社会公共利益；</p>
    <p>（2） 为维护蝌蚪网自身合法权益所必要的披露；</p>
    <p>（3） 蝌蚪网根据现行法律法规规定，认为必要的其他情况。</p>
    <p>2．播客应注意勿在使用蝌蚪网服务中透露自己的各类财产账户、银行卡、信用卡、第三方支付账户及对应密码等重要资料，也不可将自认为隐私的信息发表、上传或通过蝌蚪网的服务传播给其他人，否则由此产生的责任和损失由播客自行承担。</p>
    <p class="tit">八、账号和密码</p>
    <p>您注册成为蝌蚪网用户后方可申请签约播客，而注册用户时的账号和密码是签约播客接受蝌蚪网服务的唯一身份凭证，由播客自行负责保管并进行符合安全要求的密码设置；播客应当对以其帐号进行的所有活动和事件负法律责任。播客如发现任何非法使用其账号或安全漏洞的情况，应立即向蝌蚪网履行告知义务。</p>
    <p class="tit">九、服务的变更和终止</p>
    <p>1．鉴于网络服务的特殊性，播客同意蝌蚪网随时变更、中断或终止部分或全部的服务而无须提前通知播客或获得播客许可，蝌蚪网亦无须对播客或第三方承担任何责任。</p>
    <p class="tit">十、责任承担</p>
    <p>1．如播客违反本协议的约定，或出现其他经蝌蚪网判断可能对本协议合作造成损害的行为的，蝌蚪网有权视情况采取如下一种或几种救济措施，如因此给蝌蚪网及/或关联公司造成损失的，播客应负责赔偿：</p>
    <p>（1） 责令播客限期改正；</p>
    <p>（2） 限制/冻结播客的表演等权限；</p>
    <p>（4） 立即中止/停止向播客结算/支付实际应得奖赏；</p>
    <p>（5） 根据蝌蚪网公示的规范要求播客支付违约金。</p>
    <p>（6） 其他蝌蚪网可以依法或依约采取的救济措施。</p>
    <p>2．除非法律法规明确要求，否则蝌蚪网没有义务对所有播客的行为以及与表演有关的其它事项进行审查，但基于以下理由，蝌蚪网有权（非义务）进行审查：</p>
    <p>（1） 蝌蚪网有合理的理由认为播客及具体表演可能存在重大违法或违约情形。</p>
    <p>（2） 蝌蚪网有合理的理由认为播客在蝌蚪网的行为涉嫌违法或不当。</p>
    <p>3．如发生下列任何一种情形，蝌蚪网有权随时解除播客资格：</p>
    <p>（1） 播客违反本协议约定；</p>
    <p>（2） 播客违反蝌蚪网或机构的管理；</p>
    <p>（3） 播客提供的个人资料不真实或不合法。</p>
    <p>（4）收到针对播客的第三方投诉或政府部门通知。</p>
    <p class="tit">十一、适用法律与纠纷解决</p>
    <p>1．本协议适用中华人民共和国的法律，并且排除一切冲突法规的适用。</p>
    <p>2．当本协议的任何内容与中华人民共和国法律相抵触时，应当以法律规定为准，同时相关条款将按法律规定进行修改或重新解释，而本协议其他部分的法律效力不变。</p>
    <p>3．如播客与蝌蚪网就本协议出现纠纷，双方一致同意将纠纷交由蝌蚪网住所地人民法院管辖。</p>
    <p class="tit">十二、其他</p>
    <p>1．本协议中的标题仅为方便阅读而设，不应影响本协议任何条款的解释。</p><p></p>
    <p>2．未经蝌蚪网书面同意，您在本合同项下的权利义务不可转让。</p>
    <p>3．如本协议中的任何条款因任何原因被判定为完全或部分无效或不具有执行力的，该无效或不具有执行力的条款将被最接近原条款意图的一项有效并可执行的条款所替代，并且本协议的其余条款仍应有效并且有执行力。</p>
    <p>4．蝌蚪网及其关联公司不对平台相关服务的适用性、可靠性、准确性、完整性、稳定性、持续性、无病毒以及无错误，做出任何明示或默示保证。</p>
    <p>5．本协议项下蝌蚪网对于播客所有的通知均可通过网页公告、平台消息推送、电子邮件、手机短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。</p>
    <p>6．本协议未约定的事项以《蝌蚪用户服务协议》的约定为准，两者规定冲突的，以本协议规定为准。</p>
    <p>7．如播客对本协议内容有任何疑问，可联系客服QQ（4008989555）进行查询。</p>
    <div class="yes_no clearFix">
        <input class="agree fl" type="submit" value="同意">
        <input class="fl" type="submit" value="不同意">
    </div>
</div>