<?php
$nickname_blacklist=array("'",'"','-','|',',','admin','root','官方','客服','运营','管理','毛泽东','周恩来','刘少奇',
'江泽民','李鹏','朱镕基',
'李瑞环','尉健行','李岚清',
'胡锦涛','罗干','温家宝','蝌蚪','官方',
'吴邦国','曾庆红','贾庆林','黄菊','吴官正','李长春','吴仪','回良玉','曾培炎','周永康','曹刚川','唐家璇','华建敏','陈至立',
'陈良宇','张德江','张立昌','俞正声','王乐泉','刘云山','贺国强','郭伯雄','胡耀邦','王乐泉','王兆国','周永康','习近d平',
'李克强','吴帮国','无帮国','无邦国','无帮过','瘟家宝','假庆林','甲庆林','假青林','离长春','习远平','袭近平','李磕墙','贺过墙',
'和锅枪','粥永康','轴永康','肘永康','周健康','粥健康','周小康柴玲','达赖喇嘛','江青','张春桥','姚文元','王洪文','东条英机','希特勒',
'墨索里尼','赵紫阳','王丹','沃尔开西','李洪志','李大师','赖昌星','马加爵','班禅','额尔德尼','阿扁','阿扁万岁','热那亚','热比娅六四',
'六四运动','美国之音','密宗','民国','民进党','民运','民主','民主潮','摩门教','纳粹','南华早报','南蛮','明慧网','起义','亲民党','瘸腿帮',
'人民报','法轮功','法轮大法','打倒共产党','台独万岁','圣战','示威','台独','台独分子','台联','台湾民国','台湾岛国','台湾国','台湾独立','太子党',
'天安门事件','屠杀','小泉','新党','新疆独立','新疆分裂','新疆国','疆独','西藏独立','西藏分裂','西藏国','藏独','藏青会','藏妇会','学潮','学运',
'一党专政','一中一台','两个中国','一贯道','游行','造反','真善忍','镇压','政变','政治','政治反对派','政治犯','中共','共产党','反党','反共','政府',
'民主党','中国之春','转法轮','自焚','共党','共匪','支那','高治联','高自联','专政','专制','世界维吾尔大会','大参考','小参考','国内动态清样多维',
'河殇','摩门教','穆罕默德','圣战','耶和华','耶稣','伊斯兰','真主安拉','白莲教','天主教','基督教','东正教','大法','法轮','法轮功','瘸腿帮',
'真理教','真善忍','转法轮','自焚','走向圆满','真理教','大卫教','藏独','疆独','蒙古鞑子','台独','台独分子','台联','台湾民国','西藏独立',
'新疆独立','南蛮','老毛子','回民吃猪肉谋杀','杀人','吸毒','贩毒','赌博','拐卖','走私','卖淫','造反','强奸','轮奸','抢劫','先奸后杀','下注',
'抽头','坐庄','赌马','赌球','筹码','老虎机','轮盘赌','安非他命','大麻','可卡因','海洛因','冰毒','摇头丸','杜冷丁',
'鸦片','罂粟','迷幻药','白粉','嗑药','吸毒 AIDS','aids','Aids','DICK','dick','Dick','penis','sex','SM','屙','爱滋','淋病','梅毒',
'爱液','屄','逼','臭机八','臭鸡巴','吹喇叭','吹箫','催情药','肛交','肛门','龟头','机八','机巴','鸡八','鸡巴','机掰','机巴',
'鸡叭','鸡鸡','鸡掰','鸡奸','妓女','奸','茎','精液','精子','尻','口交','滥交','乱交','轮奸','卖淫','屁眼','嫖娼','强奸','强奸犯','肉棒',
'乳房','乳峰','乳交','乳头','乳晕','三陪','色情','射精','手手','性高潮','性交','性虐','性欲','小穴','颜射','阳物','一夜情','阴部','阴唇','阴道','阴蒂',
'阴核','阴户','阴茎','阴门','淫','淫秽','淫乱','淫水','淫娃','淫液','淫汁','淫穴','淫洞','援交妹','做爱','梦遗','阳痿','早泄','奸淫','性欲',
'性交','Bitch','FUCK','Fuck','fuck','SUCK','Suck','K他命','屄','婊子','操她妈','操妳妈','操你','操你妈','操他妈','草你','肏','册那','侧那','测拿',
'插','蠢猪','荡妇','发骚','干她妈','干妳','干妳娘','干你','干你妈','干你妈B','干你妈b','干你妈逼','干你娘','干他妈','狗娘养的','滚','鸡奸',
'贱货','贱人','烂人','老母','妈比','妈的','马的','妳老母的','妳娘的','你妈逼','破鞋','仆街','去她妈','去妳的','去妳妈','日','日你','赛她娘','赛妳娘',
'赛你娘','赛他娘','骚货','傻B','傻比','傻子','上妳','上你','屎','屎妳娘','屎你娘','他妈的','王八蛋','我操','我日','屙','掯','屌',
'操','骑你','操你','操他','操她','骑你','骑他','骑她','欠骑','欠人骑','来爽我','来插我','干你','干他','干她','干死','FUCK','机叭','臭鸡',
'臭机','烂鸟','阳具','肉棒','肉壶','奶子','摸咪咪','干鸡','小穴','强奸','插你','插你','我操','轮流干','援交','骑你','我操','轮奸','鸡奸','奸暴',
'再奸','我奸','奸你','奸你','奸她','淫水','淫湿','鸡歪','仆街','臭西','尻','遗精','烂逼','大血比','叼你妈','靠你妈','草你','干你','日你','插你','奸你',
'戳你','逼你老母','挨球','我日你','草拟妈','卖逼','狗操卖逼','奸淫','日死','奶子','阴茎','奶娘','他娘','她娘','骚B','你妈了妹','逼毛','插你妈','叼你',
'渣波波','嫩b','weelaa','系统消息','SM','ML','3P','群P','双飞周恩來','碡','籀','朱狨基','朱容基','朱溶剂','朱熔基','朱镕基','猪操','猪聋畸','躅','翥','專政',
'子宫','自焚','自民党','自慰','自由民主论坛','总理','作爱','做爱','阿扁萬歲','阿萊娜','啊無卵','埃裏克蘇特勤','埃斯萬','愛滋','愛滋病','班禪','保釣','北大三角地論壇',
'北韓','北京當局','北美自由論壇','貝尤爾','逼樣','比樣','婊子養的','操鶏','操那嗎B','操那嗎逼','操那嗎比','操你媽','操你爺爺','曹長青','曹剛川','草你媽','草擬媽',
'册那娘餓比','插那嗎B','插那嗎逼','插那嗎比','插你媽','插你爺爺','車侖','車侖女幹','沉睡圖騰','陳炳基','陳博志','陳定南','陳建銘','陳景俊','陳菊','陳軍','陳良宇',
'陳蒙','陳破空','陳水扁','陳唐山','陳希同','陳小同','陳宣良','陳學聖','陳一諮','陳總統','持不同政見','赤色騎士','赤色戰士','處女膜','傳染性病','吹簫',
'春夏自由論壇','戳那嗎B','戳那嗎逼','戳那嗎比','錯那嗎B','錯那嗎逼','錯那嗎比','達夫警衛兵','達夫侍從','達癩','打飛機','大參考','大東亞','大東亞共榮','大鶏巴',
'大紀元','大紀元新聞網','大紀園','大家論壇','大奶媽','大史記','大史紀','大衛教','大中國論壇','大中華論壇','大衆真人真事','紿','戴維教','戴相龍','蕩婦','德維爾','鄧笑貧',
'地下教會','叼你媽','丁關根','東北獨立','東部地下水路','東方紅時空','東方時空','東南西北論談','東社','東升','東條','東條英機','東突暴動','東突獨立','東土耳其斯坦',
'東西南北論壇','東院看守','動亂','鬥士哈夫拉蘇','鬥士霍克','獨裁','獨裁政治','獨夫','獨立臺灣會','俄國','鮞','㈡','發楞','發掄','發掄功','發倫','發倫功',
'發輪','發論','發論公','發論功','發騷','發正念','法~倫','法~淪','法~綸','法~輪','法~論','法爾卡','法掄','法掄功','法侖','法淪','法綸','法輪大法','法輪功',
'法十輪十功','法謫','法謫功','反封鎖','反封鎖技術','反腐敗論壇','反人類','反社會','方勵之','防衛指揮官','放蕩','飛揚論壇','廢墟守護者','費鴻泰','費良勇',
'分隊長施蒂文','粉飾太平','糞便','鱝','豐饒的果實',
'風雨神州','風雨神州論壇','幹bi','幹逼','幹比','幹的你',
'幹幹幹','幹她','幹你','幹你老比','幹你老母',
'幹你娘','幹全家','幹死','幹死你',
'幹他','幹一家','趕你娘','肛門','高自聯'
,'古龍祭壇','骨獅','鯝','鴰','詿','關卓中','貫通兩極法','廣聞','嬀','龜兒子','龜公','龜孫子','龜頭','龜投','滾那嗎B',
'作愛','做愛冰粉，性奴，发票，fuck','共产党','urban','我操','cao','他妈的','TMD','鸡巴','傻B','法轮功','江泽民',
'胡锦涛','温家宝','urban-rivals','rivals','我日','UR','ur','性交','口交','婊子','妓女','牛B，傻逼','傻B','操你妈','日你妈','妈的','妈逼','草你妈',
'JB','jb','U/R','U-R','j8','吗的','8仙','狗日','色情','黄色','藏独','台独','法轮大法','鸡巴','毛泽东','NPC',
'*法*轮*功*','*李*洪*志*阿扁万岁','澳洲光明网','八九','八九风波','办理文凭','办理证件','包皮','保钓','保密局','鸨','暴动','暴乱','暴徒','北京之春',
'贝肉','本?拉登','本?拉登','苯比','笨屄','笨逼','屄','屄毛','逼毛','逼你老母','逼样','比毛','婊','婊子','宾周','冰毒','波霸','博讯','薄一波','参事室',
'藏独','藏独','藏独','操','操GM','操Gm','操gM','操gm','操XX','操逼','操比','操蛋','操你','操你八辈祖宗','操你妈','操你妈屄','操他','曹刚川','草的你妈',
'草妈','草你妈','草拟妈','肏','插妳','插你','插你妈','插深些','朝鲜','陈良宇','陈水扁','陈希同','陈晓宁','陈至立','成人电影','成人片','吃大便','吃屎',
'迟浩田','赤匪','抽插','抽你丫的','臭化西','出售假币','出售枪支','出售手枪','吹喇叭','吹箫','春药','蠢猪','戳你','粗制吗啡','催情药','达赖','达赖喇嘛',
'打炮','大B','大逼','大便','大波波','大麻','大麻树脂','大血B','大血比','呆卵','荡妇','邓小平','叼你妈','屌','屌7','屌鸠','屌毛','屌妳','屌七','屌西',
'钓鱼台','丁关根','丁子霖','东北独立','东升','东条英机','东突','东突暴动和独立','东突组织','东亚病夫','董建华','董贱华','董文华','懂文华','独立台湾会',
'恩格斯','发抡功','发伦','发伦功','发轮','发论','发论公','发论功','发骚','法(轮)功','法*轮*功','法功','法愣','法仑','法轮','法轮大法','法轮功','法西斯',
'反共','反华','干妳','干妳老母','干妳妈','干妳娘','干你','干你妈','干你妈b','干你妈逼','干你娘','干死你','肛','肛交','肛门','高校暴乱','高校群体事件',
'高校骚乱','睾','睾丸','弓虽女干','公安','公安部','公安局','共产党','共产主义','共匪','共狗','狗b','狗操','狗卵','狗娘','狗屁','狗日','狗日的','狗屎',
'官逼民反','官商勾结','龟儿子','龟公','龟孙子','龟头','郭伯雄','国安局国民党','国民党万岁','海洛因','贺国强','黑手党','黑手党','黑手党','红卫兵','洪兴',
'洪志','后庭','胡XX','胡紧涛','胡紧掏','胡紧套','胡锦涛','胡锦淘','胡乔木','胡耀邦','胡主席','花柳','华国锋','华建敏','换妻','黄　菊','黄菊','黄色电影',
'黄色小电影','回教','回良玉','回民暴动','回族人吃猪肉','昏药','火棒','机八','机巴','鸡八','鸡巴','鸡叭','鸡芭','鸡掰','鸡奸','基地组织','激情电影','激情小电影',
'鸡','计牌软件','计生委','妓','妓女','妓院','贾庆林','奸夫淫妇','奸你','奸淫','贱逼','贱货','贱人','江Core','江八','江八点','江独裁','江核心','江青','江戏子',
'江择民','江泽民','江贼民','江折民','江猪','江猪媳','江主席','僵贼民','疆独','叫床','叫鸡','叫小姐','精液','精子','警匪一家','敬国神社','靖国神社','军妓',
'可待因','可卡叶','可卡因','口交','寇晓伟','狂操','狂操你全家','烂B','烂屄','烂逼','烂比','烂屌','烂货','劳+教+所','李长春','李登辉','李弘旨','李红志',
'李宏旨','李宏志','李洪志','李岚清','李鹏','李鹏*','李瑞环','李山','李铁映','李先念','刘　淇','刘军','刘淇','刘少奇','刘云山','六.四','六。四','六?四',
'六合彩','六四','六-四','六四事件','六四真相','龙新民','轮功','轮奸','罗　干','罗干','骡干','妈逼','妈比','妈卖妈屁','妈批','妈B','妈的','麻醉钢枪',
'麻醉枪','麻醉药','麻醉乙醚','马克思','马卖马屁','吗啡','吗啡碱','吗啡片','买卖枪支','麦角酸','卖.国','卖B','卖ID','卖QQ','卖逼','卖比','卖党求荣',
'卖号','卖卡','卖软件','卖淫','毛XX','毛厕洞','毛一鲜','毛泽东','毛贼东','毛主席','蒙尘药','蒙独','蒙古达子','蒙古独立','迷魂药','迷奸药','迷歼药',
'迷药','密洞','密宗','民运','明慧网','摩门教','莫索里尼','乳头','奶子','妳老母的','妳妈的','妳马的','妳娘的','南蛮子','南蛮子','嫩B','嫩b','你妈逼',
'你妈的','你娘','你爷爷的','拍肩神药','皮条','屁眼','嫖客','钱其琛','枪决女犯','枪决现场','枪支弹药','强奸','强奸犯','强卫','强效失意药，窃听器',
'窃听器材','亲民党','青天白日','情色','去你妈的','瘸腿帮','人大','人大代表','人代会','人民日报','人体炸弹','日你','日你妈','日你娘','日他娘','肉棒',
'肉壁','肉洞','肉缝','肉棍','肉棍子','肉穴','乳波臀浪','乳房','乳交','乳头','三个呆婊','三个代婊','三级片','三民主义','三陪','三陪女','三唑仑','骚B',
'骚逼','骚货','色情','色情电影','色情服务','色情小电影','傻屄','傻逼','傻比','傻吊','傻卵','射精','食屎','手淫','私服','私服','私-服','私—服','四川独立',
'四人帮','宋楚瑜','宋祖英','台独','台联','台湾党','台湾帝国','台湾独立','台湾共产党','台湾共和国','台湾狗','台湾国','台湾民国','太子党','唐家璇',
'田纪云','舔西','透视软','外　挂','外挂','外/挂','外挂','外_挂','外挂','外-挂','外—挂','王岐山','尉健行','温加宝','温家宝','温家保','温馨',
'温总理','我操','我操你','我干','我妳老爸','我日','我日你','无界浏览器','吴　仪','吴邦国','吴官正','吴仪，西藏独立','西藏天葬，希特勒',
'希望之声','洗脑班','系统','系统公告','系统讯息','鲜族','想上你','小鸡鸡','小肉粒','小乳头','小穴','新疆独立','性爱','性交','性虐待','性无能',
'性欲','徐光春','学潮','血逼','血腥图片','鸦片','鸦片液','鸦片渣','阳具','摇头丸','摇头玩','夜情','一党专制','一夜情','一中一台','以茎至洞',
'抑制剂','阴部','阴唇','阴道','阴蒂','阴核','阴户','阴茎','阴毛','阴水','阴小撕大','淫荡','淫秽','淫货','淫贱','淫叫','淫毛','淫靡','淫水','淫娃',
'淫语连连','淫欲','俞正声','舆论钳制','欲火焚身','援交','远程偷拍','曰你','月经','月经不调','月经','曾庆红','扎卡维','张德江，赵紫阳','侦探设备',
'真理教','中华民国','中南海','中宣部','周恩来','周永康','朱容鸡','朱容基','朱熔基','朱镕基','朱总理','猪容基','转法轮','转法轮','装屄','自焚',
'自杀手册','自杀指南','自制手枪','作爱','坐台的','做爱','共产党','江泽民','胡锦涛','温家宝','严方军','屄毛','操逼毛','东突','骚货','法轮功',
'江泽民','胡锦涛','温家宝','我日','性交','口交','婊子','妓女','操你妈','日你妈','卖号','妈逼','草你妈','T.M.D','JB','jb','U/R','U-R','c a o','j8',
'吗的','8仙','狗日','色情','黄色','h站','藏独','台独','法轮大法','urban','鸡巴','坐台','作爱','自制手枪');
function logincookie($info){
	global $app_path;
	include_once($app_path.'include/aes.func.php');
	$cookie_str=$info[userId].','.$info[nickname].'';
	return aes_encrypt($cookie_str);
}
function password_deal($pwd){
	return md5(md5($pwd));
}
function username_deal($unm){
    $url=_INTERFACE_."/rest/homeAnchors/checkLucene.mt?keyWord=".$unm;
    $js = file_get_contents($url);
    $js=json_decode($js);
    if($js->resultStatus == 101){
        return true;
    }else if($js->resultStatus == 200){
        return false;
    }
    return false;
}

function register_by_opensns($type,$snsid,$nickname,$avatar,$gender,$sns_type){
	global $db,$avatar_path,$app_path,$nickname_blacklist;
	$nickname = trim($nickname);
	if(!$page_var['IS_QQ']){
		$nc_count=$db->GetOne("select count(userId) from bu_user where nickname='$nickname'");
		if($nc_count!=0){
			$nickname.="00".$nc_count;
		}
	}
	//过滤昵称
	$nickname=str_replace($nickname_blacklist,'',$nickname);
    $nickname=urlencode($nickname);
	if(!$_COOKIE['unionid']){
		$_COOKIE['unionid'] = 0;
	}
    $timer=date('Y-m-d H:i:s',$_SERVER['REQUEST_TIME']);
    $username=$sns_type.substr(md5($snsid),1,7);
    $pass=md5($snsid);
    $gnr=$gender?$gender:0;
	$db->Execute("insert into bu_user(createDT,status,nickname,username,password,accountfrom,snsid,gender,logins) values('".$timer."',1,'$nickname','$username','$pass','$type','$snsid',$gnr,1)");

    $userid=$db->Insert_ID();
    if($userid){
        $db->Execute("insert into bu_user_packs(createDT,status,userId) values('".$timer."',1,$userid)");
    }
	$token=logincookie(array('userId'=>$userid,'nickname'=>$nickname));
	setcookie("KDUUS",$token,time()+3600,'/',_COOKIE_DOMAIN_);
	if(file_exists($app_path."modules/register_success.php")){
		$register_success_userid = $userid;
		include($app_path."modules/register_success.php");
	}
    $mz_avatar='46a920d47a9c287e627693554180598a';
	if($avatar){
        function uploadSnsImages($imgurl){
            $zimg_upload_url = _IMAGES_DOMAIN_;
            $simg=$imgurl;

            $post_data = curl_file_get_contents($simg); // raw_post方式
			
			$ch = curl_init();

            $headers = array();
            $headers[] = 'Content-Type:jpg'; // 还有这里！

            curl_setopt($ch, CURLOPT_URL, $zimg_upload_url);
            curl_setopt($ch, CURLOPT_HEADER, false);
            curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
            curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);
            curl_setopt($ch, CURLOPT_POST, true);
            curl_setopt($ch, CURLOPT_BINARYTRANSFER, true);
            curl_setopt($ch, CURLOPT_POSTFIELDS, $post_data);
	
            $info = curl_exec($ch);
            curl_close($ch);
			
            $json = json_decode($info, true);
            if($json['ret']==true){
                return $json['info']['md5'];
            }
            return false;
        }
        $md5_fanmian=uploadSnsImages($avatar);
        if(!$md5_fanmian){
            $md5_fanmian=$mz_avatar;
        }
        global $db;
        $db->Execute("update  bu_user set avatar='$md5_fanmian' where userId='{$userid}'");

	}else{
        $db->Execute("update  bu_user set avatar='{$mz_avatar}' where userId='{$userid}'");
    }
	return $token;
}

function curl_file_get_contents($durl){
   $ch = curl_init();
   curl_setopt($ch, CURLOPT_URL, $durl);
   curl_setopt($ch, CURLOPT_TIMEOUT, 2);
   curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);
   $r = curl_exec($ch);
   curl_close($ch);
   return $r;
 }

function microtime_float()
{
   list($usec, $sec) = explode(" ", microtime());
   return ((float)$usec + (float)$sec);
}

function check_nickname($nickname){

	$nickname = urldecode($nickname);
	global $db;
	if((strlen($nickname) + mb_strlen($nickname,'UTF8'))/2>16 || mb_strlen ( $nickname,'utf-8' )<2){
		return '昵称长度2~8个汉字';
	}
    $bsname=urldecode($nickname);
	if($db->GetOne("select count(userId) from bu_user where nickname='{$bsname}'")!=0){
		return '昵称已经存在';
	}
    if(!username_deal($nickname)) {
        return '昵称中含有不被允许的文字';
    }
	return 'yes';
}
function check_email($email){
	global $db;
	if(strlen($email)>50 || strlen($email)<5){
		return '邮件地址长度5~50';
	}
	else if($db->GetOne("select count(userId) from bu_user where email='{$email}'")!=0){
		return '邮件地址已经存在';
	}
	else if(!preg_match('/^[a-zA-Z0-9_]+([.][a-zA-Z0-9_]+)*[@][a-zA-Z0-9_]+([.][a-zA-Z0-9_]+)*[.][a-zA-Z]{2,4}$/',$email)){
		return '邮件地址不正确';
	}
	return 'yes';
}
function check_usernmae($username){
	global $db;
	if(strlen($username)>50 || strlen($username)<5){
		return '帐号长度5~50';
	}
    else if(!preg_match('/^[a-zA-Z0-9_]+([.][a-zA-Z0-9_]+)*[@][a-zA-Z0-9_]+([.][a-zA-Z0-9_]+)*[.][a-zA-Z]{2,4}$/',$username)){
        return '请输入正确邮箱地址';
    }
	else if($db->GetOne("select count(userId) from bu_user where username='{$username}'")!=0){
		return '帐号已经存在';
	}
	return 'yes';
}
function check_email_fromeat($email){
	if(!preg_match('/^[a-zA-Z0-9_]+([.][a-zA-Z0-9_]+)*[@][a-zA-Z0-9_]+([.][a-zA-Z0-9_]+)*[.][a-zA-Z]{2,4}$/',$email)){
		return false;
	}
	return true;
}
//随机产生用户昵称
function generateRandomNickName(){
	$randpwd = ''; 
	for ($i = 0; $i < mt_rand(6, 12); $i++){ 
		$randpwd .= chr(mt_rand(97,122)); 
	}
	return $randpwd; 
}